sslivins/arctic-simulator/sdkconfig.defaults
# Target: ESP32-S3 (M5Stack Atom S3)
CONFIG_IDF_TARGET="esp32s3"

# Serial flasher - Atom S3 uses USB-CDC
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Wi-Fi — leave empty; credentials are set via the captive portal
# and stored in NVS.  Kconfig fallback values are in Kconfig.projbuild.
CONFIG_SIMULATOR_WIFI_SSID=""
CONFIG_SIMULATOR_WIFI_PASSWORD=""

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# mDNS

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# PSRAM — enable so S3R can use its 8 MB for the recorder buffer.
# On the regular S3 (no PSRAM chip) the firmware still boots fine;
# heap_caps_get_total_size(MALLOC_CAP_SPIRAM) simply returns 0.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# UART for Modbus
CONFIG_UART_ISR_IN_IRAM=y
